using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;

namespace Vokzal
{
    /// <summary>
    /// Interaction logic for MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        List<Train> trains;

        List<string> places_kype;
        List<string> places_placard;
        public MainWindow()
        {
            InitializeComponent();
            trains = new List<Train>();

            places_kype = new List<string>();
            places_placard = new List<string>();
            GridView gridView = new GridView();
            lw.View = gridView;
            gridView.Columns.Add(new GridViewColumn
            {
                Header = "N",
                DisplayMemberBinding=new Binding("Number")
            });
            gridView.Columns.Add(new GridViewColumn
            {
                Header = "Назва",
                DisplayMemberBinding = new Binding("Name")
            });
            gridView.Columns.Add(new GridViewColumn
            {
                Header = "Відправка",
                DisplayMemberBinding = new Binding("ShortSending")
            });
            gridView.Columns.Add(new GridViewColumn
            {
                Header = "Прибуття",
                DisplayMemberBinding = new Binding("ShortArrival")
            });

            FillListView();
        }
        void FillListView()
        {
            trains.Add(new Train
            {
                Number = "8l4m1",
                Name = "Луцьк-Київ",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9"},
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 25, 12, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 25, 12, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 25, 17, 40, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 25, 17, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "l3n5h2",
                Name = "Луцьк-Львів",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 25, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 25, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 25, 17, 0, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 25, 17, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "j3k5n",
                Name = "Луцьк-Ворохта",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 10, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 10, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 11, 4, 0, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 11, 4, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "058Ш",
                Name = "Луцьк-Ковель",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 12, 14, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 12, 14, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 12, 14, 40, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 12, 14, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "j23j",
                Name = "Луцьк-Ужгород",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 4, 17, 3, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 4, 17, 3, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 5, 6, 52, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 5, 6, 52, 1).ToShortDateString(),
            });



            trains.Add(new Train
            {
                Number = "8k23",
                Name = "Луцьк-Київ",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 20, 12, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 20, 12, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 20, 17, 40, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 20, 17, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "2m4j5",
                Name = "Луцьк-Львів",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 26, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 26, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 26, 17, 0, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 26, 17, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "g7j2",
                Name = "Луцьк-Ворохта",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 18, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 18, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 19, 4, 0, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 19, 4, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "k1n4",
                Name = "Луцьк-Ковель",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 6, 14, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 6, 14, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 6, 14, 40, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 6, 14, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "8l4g",
                Name = "Луцьк-Ужгород",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 8, 17, 3, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 8, 17, 3, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 9, 6, 52, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 9, 6, 52, 1).ToShortDateString(),
            });



            trains.Add(new Train
            {
                Number = "ld4g",
                Name = "Луцьк-Київ",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 26, 12, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 26, 12, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 26, 17, 40, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 26, 17, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "j2o5",
                Name = "Луцьк-Львів",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2022, 12, 5, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 5, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2022, 12, 5, 17, 0, 1).ToShortTimeString() + " " + new DateTime(2022, 12, 5, 17, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "kk4k",
                Name = "Луцьк-Ворохта",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 6, 13, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 6, 13, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 7, 4, 0, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 7, 4, 0, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "l6y6",
                Name = "Луцьк-Ковель",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 2, 14, 15, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 2, 14, 15, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 2, 14, 40, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 2, 14, 40, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "t5t7",
                Name = "Луцьк-Ужгород",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 13, 17, 3, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 13, 17, 3, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 14, 6, 52, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 14, 6, 52, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "j12l",
                Name = "Київ-Луцьк",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 7, 7, 27, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 7, 7, 27, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 7, 13, 25, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 7, 13, 25, 1).ToShortDateString(),
            });
            trains.Add(new Train
            {
                Number = "4o21",
                Name = "Одеса-Луцьк",
                Kype = new List<string> { "Вагон 1 Місце-1", "Вагон 1 Місце-2", "Вагон 1 Місце-3", "Вагон 1 Місце-4", "Вагон 1 Місце-5", "Вагон 1 Місце-6", "Вагон 1 Місце-7", "Вагон 1 Місце-8", "Вагон 1 Місце-9", "Вагон 2 Місце-1", "Вагон 2 Місце-2", "Вагон 2 Місце-3", "Вагон 2 Місце-4", "Вагон 2 Місце-5", "Вагон 2 Місце-6", "Вагон 2 Місце-7", "Вагон 2 Місце-8", "Вагон 2 Місце-9", "Вагон 3 Місце-1", "Вагон 3 Місце-2", "Вагон 3 Місце-3", "Вагон 3 Місце-4", "Вагон 3 Місце-5", "Вагон 3 Місце-6", "Вагон 3 Місце-7", "Вагон 3 Місце-8", "Вагон 3 Місце-9" },
                PlaceCard = new List<string> { "Вагон 4 Місце-1", "Вагон 4 Місце-2", "Вагон 4 Місце-3", "Вагон 4 Місце-4", "Вагон 4 Місце-5", "Вагон 4 Місце-6", "Вагон 4 Місце-7", "Вагон 4 Місце-8", "Вагон 4 Місце-9", "Вагон 5 Місце-1", "Вагон 5 Місце-2", "Вагон 5 Місце-3", "Вагон 5 Місце-4", "Вагон 5 Місце-5", "Вагон 5 Місце-6", "Вагон 5 Місце-7", "Вагон 5 Місце-8", "Вагон 5 Місце-9", "Вагон 6 Місце-1", "Вагон 6 Місце-2", "Вагон 6 Місце-3", "Вагон 6 Місце-4", "Вагон 6 Місце-5", "Вагон 6 Місце-6", "Вагон 6 Місце-7", "Вагон 6 Місце-8", "Вагон 6 Місце-9" },
                ShortSending = new DateTime(2023, 1, 2, 18, 40, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 2, 18, 40, 1).ToShortDateString(),
                ShortArrival = new DateTime(2023, 1, 3, 8, 4, 1).ToShortTimeString() + " " + new DateTime(2023, 1, 3, 8, 4, 1).ToShortDateString(),
            });
            for (int i=0;i<trains.Count;i++)
            {
                lw.Items.Add(trains[i]);
            }
        }

        private void Button_Click(object sender, RoutedEventArgs e)
        {
            lw.Items.Clear();
            for(int i=0;i<trains.Count;i++)
            {
                if(string.Compare(zvidku.Text+"-"+kydu.Text,trains[i].Name)==0)               
                    lw.Items.Add(trains[i]);
                
            }
            
        }
        void Fill_Places_In_Vagon()
        {
            if (lw.SelectedIndex != -1)
            {
                if (kype_radio.IsChecked == true)
                {
                    places_in_vagon.Items.Clear();
                    for (int i = 0; i < ((Train)lw.SelectedItem).Kype.Count; i++)
                    {
                        places_in_vagon.Items.Add(((Train)lw.SelectedItem).Kype[i]);
                    }
                }
                if (placard_radio.IsChecked == true)
                {
                    places_in_vagon.Items.Clear();
                    for (int i = 0; i < ((Train)lw.SelectedItem).PlaceCard.Count; i++)
                    {
                        places_in_vagon.Items.Add(((Train)lw.SelectedItem).PlaceCard[i]);
                    }
                }
            }
        }

        private void lw_SelectionChanged(object sender, SelectionChangedEventArgs e)
        {
            Fill_Places_In_Vagon();
        }

        private void kype_radio_Checked(object sender, RoutedEventArgs e)
        {
            Fill_Places_In_Vagon();
        }

        private void placard_radio_Checked(object sender, RoutedEventArgs e)
        {
            Fill_Places_In_Vagon();
        }

        bool Is_Ne_Is_Plac(string tmp)
        {
            for(int i=0;i<places_placard.Count;i++)
            {
                if (string.Compare(tmp, places_placard[i]) == 0)
                    return true;
            }
            return false;
        }
        bool Is_Ne_Is_Kype(string tmp)
        {
            for (int i = 0; i < places_kype.Count; i++)
            {
                if (string.Compare(tmp, places_kype[i]) == 0)
                    return true;
            }
            return false;
        }
        void AddInfoTxt()
        {
            try
            {
                var tmp = ((string)places_in_vagon.SelectedItem).Split(" ".ToCharArray());
                korzina.Items.Add(((Train)lw.SelectedItem).ToString() + tmp[0] + " " + tmp[1] + "\n" + tmp[2]);
                korzina.Items.Add("\n------------------------------------------\n");
            }
            catch(Exception e)
            { 
            }
        }
        private void places_in_vagon_SelectionChanged(object sender, SelectionChangedEventArgs e)
        {
            lw.IsEnabled = false;
            if (places_in_vagon.Items.Count!=0)
            {
                if (kype_radio.IsChecked == true)
                {
                    if (!Is_Ne_Is_Kype((string)places_in_vagon.SelectedItem))
                    {
                        places_kype.Add((string)places_in_vagon.SelectedItem);
                        AddInfoTxt();
                    }
                }
                if (placard_radio.IsChecked == true)
                {
                    if (!Is_Ne_Is_Plac((string)places_in_vagon.SelectedItem))
                    {
                        places_placard.Add((string)places_in_vagon.SelectedItem);
                        AddInfoTxt();
                    }
                }
            }
            
        }
        void DeletePlaces(string tmp,List<string> lst)
        {
            for(int i=0;i<lst.Count;i++)
            {
                if(string.Compare(tmp,lst[i])==0)
                {
                    lst.RemoveAt(i);
                    return;
                }    
            }
        }
        
        private void Button_Click_1(object sender, RoutedEventArgs e)
        {
            for(int i=0;i<places_kype.Count;i++)
            {
                DeletePlaces(places_kype[i], ((Train)lw.SelectedItem).Kype);
            }
            for (int i = 0; i < places_placard.Count; i++)
            {
                DeletePlaces(places_placard[i], ((Train)lw.SelectedItem).PlaceCard);
            }
            places_kype.Clear();
            places_placard.Clear();
            string txt="";
            for(int i=0;i<korzina.Items.Count;i++)
            {
                txt += korzina.Items[i];
            }
            korzina.Items.Clear();
            Fill_Places_In_Vagon();
            MessageBox.Show(txt);
            lw.IsEnabled = true;


        }
    }

    class Train
    {       
        public string Number { set; get; }
        public string Name { set; get; }
        public string ShortSending { set; get; }
        public string ShortArrival { set; get; }
        public List<string> Kype { set; get; }
        public List<string> PlaceCard { set; get; }
        public override string ToString()
        {
            return Number + "\n" + Name + "\n" + "Відправка - " + ShortSending + "\n" + "Прибуття - " + ShortArrival + "\n";
        }
        
    }
    
}
